# GetCircuitIdByCell Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..GetCircuitIdByCell Method
PanelScheduleView Class See Also
---
Gets the circuit id for the given slot number
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId GetCircuitIdByCell(
	int nRow,
	int nCol
)
```

Visual Basic
---
```text
Public Function GetCircuitIdByCell ( _
	nRow As Integer, _
	nCol As Integer _
) As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetCircuitIdByCell(
	int nRow,
	int nCol
)
```

# ### Parameters
nRow
    Type: System..::..Int32 Row Number
nCol
    Type: System..::..Int32 Column Number
# ### Return Value
ElementId of the circuit found at the given row and column
# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace